In [1]:
import pandas as pd

In [2]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19]}

df = pd.DataFrame(data1)
df

     Name  Age
0     Tom   20
1  Joseph   21
2     Bob   19

In [3]:
df["Name"] ##列(縦)の取得

0       Tom
1    Joseph
2       Bob
Name: Name, dtype: object

In [4]:
df.loc[0] ##行(横)の取得

Name    Tom
Age      20
Name: 0, dtype: object

In [5]:
df.info() ##データフレームの情報を取得

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [6]:
df[df["Age"] > 20] ##条件に合致するデータを取得

     Name  Age
1  Joseph   21

In [7]:
df["Age_in_days"] = df["Age"] * 365 ##新しい列を追加
df

     Name  Age  Age_in_days
0     Tom   20         7300
1  Joseph   21         7665
2     Bob   19         6935